etsy_clone/app/controllers/api/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def show
        @product = Product.with_attached_photos.find(params[:id])