etsy_clone/app/controllers/api/products_controller.rb

    def selected_product
        Product.find_by(params[:id])
---
SELECT  "products".* FROM "products" WHERE (1) LIMIT $1  [["LIMIT", 1]]