etsy_clone/app/controllers/api/sessions_controller.rb

     def create
        email = (params[:user][:email])
        password = (params[:user][:password])

        @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
        email_exists = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jamie@123.com"], ["LIMIT", 1]]